## Importing Libraries

In [16]:
import pandas as pd
from sqlalchemy import create_engine

## Establishing Connection Between SQL and Python

**Match Analysis**

In [342]:
DATABASE_USER = "root"
DATABASE_PASSWORD = "ansh2003"
DATABASE_NAME = "ODIWORLDCUP2023"
DATABASE_HOST = "localhost"

engine = create_engine(f"mysql+mysqlconnector://{DATABASE_USER}:{DATABASE_PASSWORD}@{DATABASE_HOST}/{DATABASE_NAME}")


query = "SELECT * FROM matches"
df = pd.read_sql(query, engine)

conn.close()

In [344]:
df.head(5)

,season,team1,team2,date,match_number,venue,city,toss_winner,toss_decision,player_of_match,umpire1,umpire2,reserve_umpire,match_referee,winner,winner_runs,winner_wickets,match_type
0,2023/24,England,New Zealand,2023/10/05,1,Narendra Modi Stadium,Ahmedabad,New Zealand,field,R Ravindra,HDPK Dharmasena,Nitin Menon,Sharfuddoula,J Srinath,New Zealand,,9,Group
1,2023/24,Pakistan,Netherlands,2023/10/06,2,Rajiv Gandhi International Stadium,Hyderabad,Netherlands,field,Saud Shakeel,AT Holdstock,CM Brown,PR Reiffel,JJ Crowe,Pakistan,81,,Group
2,2023/24,Afghanistan,Bangladesh,2023/10/07,3,Himachal Pradesh Cricket Association Stadium,Dharamsala,Bangladesh,field,Mehedi Hasan Miraz,JS Wilson,HDPK Dharmasena,M Erasmus,AJ Pycroft,Bangladesh,,6,Group
3,2023/24,South Africa,Sri Lanka,2023/10/07,4,Arun Jaitley Stadium,Delhi,Sri Lanka,field,AK Markram,RK Illingworth,Sharfuddoula,AG Wharf,J Srinath,South Africa,102,,Group
4,2023/24,Australia,India,2023/10/08,5,MA Chidambaram Stadium,Chennai,Australia,bat,KL Rahul,CB Gaffaney,RA Kettleborough,AT Holdstock,RB Richardson,India,,6,Group

In [335]:
df.shape

(48, 18)

In [346]:
df.describe()

       match_number
count         48.00
mean          24.50
std           14.00
min            1.00
25%           12.75
50%           24.50
75%           36.25
max           48.00

In [337]:
df.isnull().sum()

season             0
team1              0
team2              0
date               0
match_number       0
venue              0
city               0
toss_winner        0
toss_decision      0
player_of_match    0
umpire1            0
umpire2            0
reserve_umpire     0
match_referee      0
winner             0
winner_runs        0
winner_wickets     0
match_type         0
dtype: int64

In [350]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48 entries, 0 to 47
Data columns (total 18 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   season           48 non-null     object
 1   team1            48 non-null     object
 2   team2            48 non-null     object
 3   date             48 non-null     object
 4   match_number     48 non-null     int64
 5   venue            48 non-null     object
 6   city             48 non-null     object
 7   toss_winner      48 non-null     object
 8   toss_decision    48 non-null     object
 9   player_of_match  48 non-null     object
 10  umpire1          48 non-null     object
 11  umpire2          48 non-null     object
 12  reserve_umpire   48 non-null     object
 13  match_referee    48 non-null     object
 14  winner           48 non-null     object
 15  winner_runs      48 non-null     object
 16  winner_wickets   48 non-null     object
 17  match_type       48 non-null     object
dtypes: int64(1), object(17)
memory usage: 6.9+ KB

In [352]:
df['toss_decision'] = df['toss_decision'].replace({'bat': 'Bat', 'field': 'Field'})

**Toss winners who won the match, analyzed venue-wise**

In [80]:
df_winner= df[df['toss_winner']==df['winner']].groupby('venue').size().reset_index(name='match_count')
result=df_winner.sort_values(by='match_count', ascending=False)
print(result)

                                          venue  match_count
1                                  Eden Gardens            3
3                         M Chinnaswamy Stadium            3
5       Maharashtra Cricket Association Stadium            3
6                         Narendra Modi Stadium            3
0                          Arun Jaitley Stadium            2
2  Himachal Pradesh Cricket Association Stadium            2
7                              Wankhede Stadium            2
4                        MA Chidambaram Stadium            1

**Toss winners who won the match, analyzed based on batting or bowling first**

In [88]:
df_winner2= df[df['toss_winner']==df['winner']].groupby('toss_decision').size().reset_index(name='Wins')
print(df_winner2)

  toss_decision  Wins
0           Bat     8
1         Field    11

## Points Table Analysis

In [90]:
query2 = "SELECT * FROM points_table"
df2 = pd.read_sql(query2, engine)

In [100]:
df2.head(5)

,Ranking,Team,Matches,Won,Lost,Tie,No Results,Points,Net Run Rate,For,Against
0,1,India,9,9,0,0,0,18,2.570,2523/396.2,1708/450.0
1,2,South Africa,9,7,2,0,0,14,1.261,2685/437.5,2158/443.0
2,3,Australia,9,7,2,0,0,14,0.841,2631/426.5,2349/441.2
3,4,New Zealand,9,5,4,0,0,10,0.743,2315/378.0,2279/423.3
4,5,Pakistan,9,4,5,0,0,8,-0.199,2328/406.2,2385/402.2

In [ ]:
df2.drop('For',axis=1,inplace=True)

In [117]:
df2.drop('Against',axis=1,inplace=True)

In [119]:
df2.head(5)

,Ranking,Team,Matches,Won,Lost,Tie,No Results,Points,Net Run Rate
0,1,India,9,9,0,0,0,18,2.570
1,2,South Africa,9,7,2,0,0,14,1.261
2,3,Australia,9,7,2,0,0,14,0.841
3,4,New Zealand,9,5,4,0,0,10,0.743
4,5,Pakistan,9,4,5,0,0,8,-0.199

In [121]:
df2.tail(5)

,Ranking,Team,Matches,Won,Lost,Tie,No Results,Points,Net Run Rate
5,6,Afghanistan,9,4,5,0,0,8,-0.336
6,7,England,9,3,6,0,0,6,-0.572
7,8,Bangladesh,9,2,7,0,0,4,-1.087
8,9,Sri Lanka,9,2,7,0,0,4,-1.419
9,10,Netherlands,9,2,7,0,0,4,-1.825

**Worst Performing Team**

In [145]:
df2[df2['Points']==df2['Points'].min()]

,Ranking,Team,Matches,Won,Lost,Tie,No Results,Points,Net Run Rate
7,8,Bangladesh,9,2,7,0,0,4,-1.087
8,9,Sri Lanka,9,2,7,0,0,4,-1.419
9,10,Netherlands,9,2,7,0,0,4,-1.825

## Top Performers Ananlysis

**Reading Data**

In [149]:
df3=pd.read_csv('deliveries.csv')

In [361]:
df3.head(5)

,match_id,season,start_date,venue,innings,ball,batting_team,bowling_team,striker,non_striker,...,wides,noballs,byes,legbyes,penalty,wicket_type,player_dismissed,other_wicket_type,other_player_dismissed,runs_conceded
0,1,2023/24,2023-10-05,"Narendra Modi Stadium, Ahmedabad",1,0.1,England,New Zealand,JM Bairstow,DJ Malan,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0
1,1,2023/24,2023-10-05,"Narendra Modi Stadium, Ahmedabad",1,0.2,England,New Zealand,JM Bairstow,DJ Malan,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6
2,1,2023/24,2023-10-05,"Narendra Modi Stadium, Ahmedabad",1,0.3,England,New Zealand,JM Bairstow,DJ Malan,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1
3,1,2023/24,2023-10-05,"Narendra Modi Stadium, Ahmedabad",1,0.4,England,New Zealand,DJ Malan,JM Bairstow,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1
4,1,2023/24,2023-10-05,"Narendra Modi Stadium, Ahmedabad",1,0.5,England,New Zealand,JM Bairstow,DJ Malan,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4

In [169]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26119 entries, 0 to 26118
Data columns (total 22 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   match_id                26119 non-null  int64
 1   season                  26119 non-null  object
 2   start_date              26119 non-null  object
 3   venue                   26119 non-null  object
 4   innings                 26119 non-null  int64
 5   ball                    26119 non-null  float64
 6   batting_team            26119 non-null  object
 7   bowling_team            26119 non-null  object
 8   striker                 26119 non-null  object
 9   non_striker             26119 non-null  object
 10  bowler                  26119 non-null  object
 11  runs_off_bat            26119 non-null  int64
 12  extras                  26119 non-null  int64
 13  wides                   665 non-null    float64
 14  noballs                 56 non-null     float64
 15  byes                    38 non-null     float64
 16  legbyes                 193 non-null    float64
 17  penalty                 1 non-null      float64
 18  wicket_type             729 non-null    object
 19  player_dismissed        729 non-null    object
 20  other_wicket_type       1 non-null      object
 21  other_player_dismissed  1 non-null      object
dtypes: float64(6), int64(4), object(12)
memory usage: 4.4+ MB

In [363]:
df3.shape

(26119, 23)

In [171]:
df3.isnull().sum()

match_id                      0
season                        0
start_date                    0
venue                         0
innings                       0
ball                          0
batting_team                  0
bowling_team                  0
striker                       0
non_striker                   0
bowler                        0
runs_off_bat                  0
extras                        0
wides                     25454
noballs                   26063
byes                      26081
legbyes                   25926
penalty                   26118
wicket_type               25390
player_dismissed          25390
other_wicket_type         26118
other_player_dismissed    26118
dtype: int64

**Transforming Data**

In [374]:
df3['wides']=df3['wides'].fillna(0).astype(int)
df3['noballs']=df3['noballs'].fillna(0).astype(int)

**Top runs scorer**

In [210]:
top_player=df3.groupby('striker')['runs_off_bat'].sum().sort_values(ascending=False)
top_player.head(5)

striker
V Kohli        765
RG Sharma      597
Q de Kock      594
R Ravindra     578
DJ Mitchell    552
Name: runs_off_bat, dtype: int64

**Top wicket taker**

In [234]:
wickets_data = df3.dropna(subset=['wicket_type'])
a=(wickets_data['bowler'].value_counts()).head()
a

bowler
Mohammed Shami    25
A Zampa           23
D Madushanka      22
G Coetzee         20
JJ Bumrah         20
Name: count, dtype: int64

**Total wicket taken, team-wise**

In [372]:
wickets_team=df3.groupby('bowling_team')['wicket_type'].count().sort_values(ascending=False)
wickets_team

bowling_team
India           100
Australia        93
South Africa     89
New Zealand      73
England          69
Pakistan         67
Netherlands      66
Afghanistan      61
Sri Lanka        57
Bangladesh       54
Name: wicket_type, dtype: int64

**Best economoy rate**

In [378]:
df3['runs_conceded'] = df3['runs_off_bat'] + df3['wides'] +df3['noballs']
best_eco = df3.groupby('bowler').agg({'runs_conceded': 'sum', 'ball': 'count'}).reset_index()
best_eco['overs_bowled'] = best_eco['ball'] / 6 
best_eco['economy_rate'] = best_eco['runs_conceded'] / best_eco['overs_bowled']

print(best_eco[['bowler', 'economy_rate','ball']].sort_values(by='economy_rate',ascending=True))

           bowler  economy_rate  ball
73       R Ashwin      3.400000    60
33      JJ Bumrah      3.905759   573
36     KA Maharaj      4.095941   542
59  Mohammad Nabi      4.096774   372
76      RA Jadeja      4.226549   565
..            ...           ...   ...
28   Hasan Mahmud      9.000000    88
37   KIC Asalanka     10.000000     6
29       IS Sodhi     10.560000    25
31    JDS Neesham     10.584270    89
80    Rahmat Shah     12.000000     6

[102 rows x 3 columns]

**Highest Individual Score**

In [319]:
highest_individual_scores = df3.groupby(['match_id', 'striker'])['runs_off_bat'].sum().reset_index()
max_scores_in_each_match = highest_individual_scores.groupby(['match_id','striker'])['runs_off_bat'].max().sort_values(ascending=False)

print(max_scores_in_each_match.head(10))

match_id  striker
39        GJ Maxwell           201
43        MR Marsh             177
23        Q de Kock            174
18        DA Warner            163
1         DP Conway            152
7         DJ Malan             140
48        TM Head              137
46        DJ Mitchell          134
32        HE van der Dussen    133
8         Mohammad Rizwan      131
Name: runs_off_bat, dtype: int64